---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateSystemPanel
source: html/d8fa7361-9dc1-1b03-3e1f-b269563962bf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateSystemPanel Property

Can't create Curtain Panel in opening. The opening is probably too small.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateSystemPanel { get; }
```